<center> <h2 Style="background-color:green; color:black"> <br> Pandas <br> </h2>

In [ ]:
# Library is for analysing the structured data through the following data structures
# Series
# DataFrame

In [ ]:
# Series one dim array for storing any data type

In [12]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [2]:
S1=pd.Series([50,45,35,48,50])

In [3]:
S1

0    50
1    45
2    35
3    48
4    50
dtype: int64

In [4]:
type(S1)

pandas.core.series.Series

In [5]:
# add index (custom index)
S2=pd.Series([50,45,35,48,50],index=['std1','std2','std3','std4','std5'])
S2

std1    50
std2    45
std3    35
std4    48
std5    50
dtype: int64

In [6]:
S2['std4']

48

In [7]:
S2.values

array([50, 45, 35, 48, 50], dtype=int64)

In [8]:
S2.index

Index(['std1', 'std2', 'std3', 'std4', 'std5'], dtype='object')

In [9]:
# append the new student
temp=pd.Series([49],index=['std6'])

In [10]:
S2=S2.append(temp)

C:\Users\Admin\AppData\Local\Temp\ipykernel_9276\2343911900.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  S2=S2.append(temp)

In [11]:
S2

std1    50
std2    45
std3    35
std4    48
std5    50
std6    49
dtype: int64

In [13]:
S2=S2.append(temp)

In [14]:
S2

std1    50
std2    45
std3    35
std4    48
std5    50
std6    49
std6    49
dtype: int64

In [20]:
S3=pd.concat([S2,temp])
S3

std1    50
std2    45
std3    35
std4    48
std5    50
std6    49
std6    49
std6    49
dtype: int64

In [15]:
S2.head(2)

std1    50
std2    45
dtype: int64

In [16]:
S2.tail(2)

std6    49
std6    49
dtype: int64

In [17]:
S2.tail()

std3    35
std4    48
std5    50
std6    49
std6    49
dtype: int64

In [ ]:
# retrieveing using the methods iloc[] and loc[] integer location and location
# slicing

In [18]:
#loc works with sutom index
S2.loc[['std4','std5']]

std4    48
std5    50
dtype: int64

In [21]:
S2.loc['std1']

50

In [22]:
S2.iloc[0]

50

In [23]:
S2.iloc[0:4]  # slicing

std1    50
std2    45
std3    35
std4    48
dtype: int64

In [24]:
S2.index

Index(['std1', 'std2', 'std3', 'std4', 'std5', 'std6', 'std6'], dtype='object')

In [25]:
S2.values

array([50, 45, 35, 48, 50, 49, 49], dtype=int64)

In [26]:
S2.sort_values()

std3    35
std2    45
std4    48
std6    49
std6    49
std1    50
std5    50
dtype: int64

In [27]:
S2

std1    50
std2    45
std3    35
std4    48
std5    50
std6    49
std6    49
dtype: int64

In [28]:
S2.sort_values(inplace=True)

In [29]:
S2

std3    35
std2    45
std4    48
std6    49
std6    49
std1    50
std5    50
dtype: int64

In [30]:
S2.sort_values(inplace=True, ascending=False)

In [31]:
S2

std1    50
std5    50
std6    49
std6    49
std4    48
std2    45
std3    35
dtype: int64

In [ ]:
# aggergtion :max, min, sum, mean,median

In [32]:
S2.mean()

46.57142857142857

In [33]:
S2.agg(['sum','max','min','mean','median','unique','count'])

sum                        326
max                         50
min                         35
mean                 46.571429
median                    49.0
unique    [50, 49, 48, 45, 35]
count                        7
dtype: object

In [34]:
S2.shape

(7,)

In [35]:
S2.size

7

In [36]:
S2.describe()

count     7.000000
mean     46.571429
std       5.380742
min      35.000000
25%      46.500000
50%      49.000000
75%      49.500000
max      50.000000
dtype: float64

In [37]:
S2.replace(to_replace=49,value=50)

std1    50
std5    50
std6    50
std6    50
std4    48
std2    45
std3    35
dtype: int64

In [38]:
S2.drop(S2.index[2:4])
S2

std1    50
std5    50
std6    49
std6    49
std4    48
std2    45
std3    35
dtype: int64

In [39]:
S2.drop(S2.index[2:4],inplace=True)
S2

std1    50
std5    50
std4    48
std2    45
std3    35
dtype: int64

# DataFrame

In [41]:
import pandas as pd

In [42]:
df=pd.DataFrame()

In [44]:
type(df)

pandas.core.frame.DataFrame

In [50]:
std_data= {'name':['std1', 'std2', 'std3', 'std4', 'std5', 'std6'],
           'marks': [50, 45, 35, 48, 50, 49],
           'age':[20,21,22,20,21,20]
          }

In [51]:
std_data

{'name': ['std1', 'std2', 'std3', 'std4', 'std5', 'std6'],
 'marks': [50, 45, 35, 48, 50, 49],
 'age': [20, 21, 22, 20, 21, 20]}

In [52]:
type(std_data)

dict

In [53]:
df=pd.DataFrame(std_data)
df

   name  marks  age
0  std1     50   20
1  std2     45   21
2  std3     35   22
3  std4     48   20
4  std5     50   21
5  std6     49   20

In [54]:
# single column
df['name']

0    std1
1    std2
2    std3
3    std4
4    std5
5    std6
Name: name, dtype: object

In [59]:
# multiple columns
df[['name','marks']]

   name  marks
0  std1     50
1  std2     45
2  std3     35
3  std4     48
4  std5     50
5  std6     49

In [56]:
# first row
df.iloc[0]

name     std1
marks      50
age        20
Name: 0, dtype: object

In [57]:
# first two rows
df.iloc[0:2]

   name  marks  age
0  std1     50   20
1  std2     45   21

In [58]:
#first row and third column
df.iloc[0,2]

20

In [60]:
df.loc[5] # index label 5

name     std6
marks      49
age        20
Name: 5, dtype: object

In [61]:
# Concatenation
std_data1= {'name':['std7', 'std8', 'std9', 'std10'],
           'marks': [45, 48, 50, 49],
           'age':[20,21,21,20]
          }

In [62]:
df[['name','age']]

   name  age
0  std1   20
1  std2   21
2  std3   22
3  std4   20
4  std5   21
5  std6   20

In [64]:
df1=pd.DataFrame(std_data1)

In [65]:
df1

    name  marks  age
0   std7     45   20
1   std8     48   21
2   std9     50   21
3  std10     49   20

In [66]:
df

   name  marks  age
0  std1     50   20
1  std2     45   21
2  std3     35   22
3  std4     48   20
4  std5     50   21
5  std6     49   20

In [67]:
df2=pd.concat([df,df1])

In [68]:
df2

    name  marks  age
0   std1     50   20
1   std2     45   21
2   std3     35   22
3   std4     48   20
4   std5     50   21
5   std6     49   20
0   std7     45   20
1   std8     48   21
2   std9     50   21
3  std10     49   20

In [69]:
df2=pd.concat([df,df1],axis=1) # concatenate column wise
df2

   name  marks  age   name  marks   age
0  std1     50   20   std7   45.0  20.0
1  std2     45   21   std8   48.0  21.0
2  std3     35   22   std9   50.0  21.0
3  std4     48   20  std10   49.0  20.0
4  std5     50   21    NaN    NaN   NaN
5  std6     49   20    NaN    NaN   NaN

In [70]:
df2=pd.concat([df,df1],axis=0) # concatenate row wise
df2

    name  marks  age
0   std1     50   20
1   std2     45   21
2   std3     35   22
3   std4     48   20
4   std5     50   21
5   std6     49   20
0   std7     45   20
1   std8     48   21
2   std9     50   21
3  std10     49   20

In [72]:
df2.reset_index(drop=True,inplace=True)
df2

    name  marks  age
0   std1     50   20
1   std2     45   21
2   std3     35   22
3   std4     48   20
4   std5     50   21
5   std6     49   20
6   std7     45   20
7   std8     48   21
8   std9     50   21
9  std10     49   20

In [75]:
df3=pd.concat([df,df1],axis=0) # concatenate row wise

In [76]:
df3

    name  marks  age
0   std1     50   20
1   std2     45   21
2   std3     35   22
3   std4     48   20
4   std5     50   21
5   std6     49   20
0   std7     45   20
1   std8     48   21
2   std9     50   21
3  std10     49   20

In [77]:
df3.index=['std1', 'std2', 'std3', 'std4', 'std5', 'std6','std7', 'std8', 'std9', 'std10']

In [78]:
df3

        name  marks  age
std1    std1     50   20
std2    std2     45   21
std3    std3     35   22
std4    std4     48   20
std5    std5     50   21
std6    std6     49   20
std7    std7     45   20
std8    std8     48   21
std9    std9     50   21
std10  std10     49   20

# Files

In [ ]:
# DataFrame from CSV file

In [79]:
import pandas as pd

In [80]:
# read_csv()
data=pd.read_csv('Store.csv')

In [81]:
data.head(10)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,1,2,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,2,3,CA-2013-138688,6/13/2013,6/17/2013,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,3,4,US-2012-108966,10-11-2012,10/18/2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,4,5,US-2012-108966,10-11-2012,10/18/2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
5,5,6,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,FUR-FU-10001487,Furniture,Furnishings,Eldon Expressions Wood and Plastic Desk Access...,48.8600,7,0.00,14.1694
6,6,7,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,OFF-AR-10002833,Office Supplies,Art,Newell 322,7.2800,4,0.00,1.9656
7,7,8,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,TEC-PH-10002275,Technology,Phones,Mitel 5320 IP Phone VoIP phone,907.1520,6,0.20,90.7152
8,8,9,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,OFF-BI-10003910,Office Supplies,Binders,DXL Angle-View Binders with Locking Rings by S...,18.5040,3,0.20,5.7825
9,9,10,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,OFF-AP-10002892,Office Supplies,Appliances,Belkin F5C206VTEL 6 Outlet Surge,114.9000,5,0.00,34.4700

In [85]:
# E:\SK\MUJ_MBA\Store.csv
# data1=pd.read_csv('E:\\SK\\MUJ_MBA\\Store.csv')
data2=pd.read_csv('E:/SK/MUJ_MBA/Store.csv')

In [86]:
# data1.head(10)
data2.head(10)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,1,2,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,2,3,CA-2013-138688,6/13/2013,6/17/2013,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,3,4,US-2012-108966,10-11-2012,10/18/2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,4,5,US-2012-108966,10-11-2012,10/18/2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
5,5,6,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,FUR-FU-10001487,Furniture,Furnishings,Eldon Expressions Wood and Plastic Desk Access...,48.8600,7,0.00,14.1694
6,6,7,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,OFF-AR-10002833,Office Supplies,Art,Newell 322,7.2800,4,0.00,1.9656
7,7,8,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,TEC-PH-10002275,Technology,Phones,Mitel 5320 IP Phone VoIP phone,907.1520,6,0.20,90.7152
8,8,9,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,OFF-BI-10003910,Office Supplies,Binders,DXL Angle-View Binders with Locking Rings by S...,18.5040,3,0.20,5.7825
9,9,10,CA-2011-115812,06-09-2011,6/14/2011,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,...,90032,West,OFF-AP-10002892,Office Supplies,Appliances,Belkin F5C206VTEL 6 Outlet Surge,114.9000,5,0.00,34.4700

In [87]:
type(data)

pandas.core.frame.DataFrame

In [88]:
data.tail(10)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9984,9984,9985,CA-2012-100251,5/17/2012,5/23/2012,Standard Class,DV-13465,Dianna Vittorini,Consumer,United States,...,11561,East,OFF-LA-10003766,Office Supplies,Labels,Self-Adhesive Removable Labels,31.500,10,0.0,15.1200
9985,9985,9986,CA-2012-100251,5/17/2012,5/23/2012,Standard Class,DV-13465,Dianna Vittorini,Consumer,United States,...,11561,East,OFF-SU-10000898,Office Supplies,Supplies,Acme Hot Forged Carbon Steel Scissors with Nic...,55.600,4,0.0,16.1240
9986,9986,9987,CA-2013-125794,9/30/2013,10-04-2013,Standard Class,ML-17410,Maris LaWare,Consumer,United States,...,90008,West,TEC-AC-10003399,Technology,Accessories,Memorex Mini Travel Drive 64 GB USB 2.0 Flash ...,36.240,1,0.0,15.2208
9987,9987,9988,CA-2014-163629,11/18/2014,11/22/2014,Standard Class,RA-19885,Ruben Ausman,Corporate,United States,...,30605,South,TEC-AC-10001539,Technology,Accessories,Logitech G430 Surround Sound Gaming Headset wi...,79.990,1,0.0,28.7964
9988,9988,9989,CA-2014-163629,11/18/2014,11/22/2014,Standard Class,RA-19885,Ruben Ausman,Corporate,United States,...,30605,South,TEC-PH-10004006,Technology,Phones,Panasonic KX - TS880B Telephone,206.100,5,0.0,55.6470
9989,9989,9990,CA-2011-110422,1/22/2011,1/24/2011,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.248,3,0.2,4.1028
9990,9990,9991,CA-2014-121258,2/27/2014,03-04-2014,Standard Class,DB-13060,Dave Brooks,Consumer,United States,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.960,2,0.0,15.6332
9991,9991,9992,CA-2014-121258,2/27/2014,03-04-2014,Standard Class,DB-13060,Dave Brooks,Consumer,United States,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.576,2,0.2,19.3932
9992,9992,9993,CA-2014-121258,2/27/2014,03-04-2014,Standard Class,DB-13060,Dave Brooks,Consumer,United States,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.600,4,0.0,13.3200
9993,9993,9994,CA-2014-119914,05-05-2014,05-10-2014,Second Class,CC-12220,Chris Cortes,Consumer,United States,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.160,2,0.0,72.9480

In [89]:
data.shape

(9994, 22)

In [90]:
data.shape[1]

22

In [91]:
data.describe()

,Unnamed: 0,Row ID,Postal Code,Sales,Quantity,Discount,Profit
count,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4996.500000,4997.500000,55190.379428,229.858001,3.789574,0.156203,28.656896
std,2885.163629,2885.163629,32063.693350,623.245101,2.225110,0.206452,234.260108
min,0.000000,1.000000,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2498.250000,2499.250000,23223.000000,17.280000,2.000000,0.000000,1.728750
50%,4996.500000,4997.500000,56430.500000,54.490000,3.000000,0.200000,8.666500
75%,7494.750000,7495.750000,90008.000000,209.940000,5.000000,0.200000,29.364000
max,9993.000000,9994.000000,99301.000000,22638.480000,14.000000,0.800000,8399.976000

In [92]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     9994 non-null   int64
 1   Row ID         9994 non-null   int64
 2   Order ID       9994 non-null   object
 3   Order Date     9994 non-null   object
 4   Ship Date      9994 non-null   object
 5   Ship Mode      9994 non-null   object
 6   Customer ID    9994 non-null   object
 7   Customer Name  9994 non-null   object
 8   Segment        9994 non-null   object
 9   Country        9994 non-null   object
 10  City           9994 non-null   object
 11  State          9994 non-null   object
 12  Postal Code    9994 non-null   int64
 13  Region         9994 non-null   object
 14  Product ID     9994 non-null   object
 15  Category       9994 non-null   object
 16  Sub-Category   9994 non-null   object
 17  Product Name   9994 non-null   object
 18  Sales          9994 non-null   float64
 19  Quantity       9994 non-null   int64
 20  Discount       9994 non-null   float64
 21  Profit         9994 non-null   float64
dtypes: float64(3), int64(4), object(15)
memory usage: 1.7+ MB

In [93]:
data.columns

Index(['Unnamed: 0', 'Row ID', 'Order ID', 'Order Date', 'Ship Date',
       'Ship Mode', 'Customer ID', 'Customer Name', 'Segment', 'Country',
       'City', 'State', 'Postal Code', 'Region', 'Product ID', 'Category',
       'Sub-Category', 'Product Name', 'Sales', 'Quantity', 'Discount',
       'Profit'],
      dtype='object')

In [94]:
data['Region'].unique()

array(['South', 'West', 'Central', 'East'], dtype=object)

In [95]:
data['Segment'].unique()

array(['Consumer', 'Corporate', 'Home Office'], dtype=object)

In [96]:
data['Category'].unique()

array(['Furniture', 'Office Supplies', 'Technology'], dtype=object)

## Data summary

In [98]:
data['Region'].value_counts()

West       3203
East       2848
Central    2323
South      1620
Name: Region, dtype: int64

In [99]:
data['Category'].value_counts()

Office Supplies    6026
Furniture          2121
Technology         1847
Name: Category, dtype: int64

In [100]:
# group by category and calculate the total sales
data.groupby(['Category'])['Sales'].sum()

Category
Furniture          741999.7953
Office Supplies    719047.0320
Technology         836154.0330
Name: Sales, dtype: float64

In [101]:
data.groupby(['Category'])['Sales'].max()

Category
Furniture           4416.174
Office Supplies     9892.740
Technology         22638.480
Name: Sales, dtype: float64

In [102]:
# group by Region and category and calculate the total sales
data.groupby(['Region','Category'])['Sales'].sum()

Region   Category
Central  Furniture          163797.1638
         Office Supplies    167026.4150
         Technology         170416.3120
East     Furniture          208291.2040
         Office Supplies    205516.0550
         Technology         264973.9810
South    Furniture          117298.6840
         Office Supplies    125651.3130
         Technology         148771.9080
West     Furniture          252612.7435
         Office Supplies    220853.2490
         Technology         251991.8320
Name: Sales, dtype: float64

In [104]:
data.groupby(['Region','Category']).agg({'Sales':'sum'})

                               Sales
Region  Category
Central Furniture        163797.1638
        Office Supplies  167026.4150
        Technology       170416.3120
East    Furniture        208291.2040
        Office Supplies  205516.0550
        Technology       264973.9810
South   Furniture        117298.6840
        Office Supplies  125651.3130
        Technology       148771.9080
West    Furniture        252612.7435
        Office Supplies  220853.2490
        Technology       251991.8320

## Pivot

In [ ]:
# used to reshape and provides rows and columns

In [105]:
data.pivot_table(index='Region',columns='Category',values='Sales',aggfunc='sum')

Category    Furniture  Office Supplies  Technology
Region
Central   163797.1638       167026.415  170416.312
East      208291.2040       205516.055  264973.981
South     117298.6840       125651.313  148771.908
West      252612.7435       220853.249  251991.832

In [106]:
data.pivot_table(index='Category',columns='Region',values='Sales',aggfunc='sum')

Region               Central        East       South         West
Category
Furniture        163797.1638  208291.204  117298.684  252612.7435
Office Supplies  167026.4150  205516.055  125651.313  220853.2490
Technology       170416.3120  264973.981  148771.908  251991.8320

In [107]:
# DataFrame from xlsx
data5=pd.read_excel('Sales_data.xlsx')

In [108]:
data5.head(2)

  Deal       X       Y      Z
0   D1  155000  100000  65000
1   D2   25000  110000  45000

In [109]:
data_1 = {
    'Name': ['John', 'Jane', 'Bob', 'Alice', 'Eve'],
    'English': [75, 80, 85, 88, 92]
}

df_1 = pd.DataFrame(data_1)
df_1

    Name  English
0   John       75
1   Jane       80
2    Bob       85
3  Alice       88
4    Eve       92

In [110]:
data_2 = {
    'Name': ['John', 'Jane', 'Bob', 'Alice', 'Eve'],
    'Math': [85, 90, 78, 92, 88],
    'Science': [92, 88, 90, 85, 78]
}

df_2 = pd.DataFrame(data_2)

In [111]:
df_2

    Name  Math  Science
0   John    85       92
1   Jane    90       88
2    Bob    78       90
3  Alice    92       85
4    Eve    88       78

In [112]:
# Merge two data frames based on common column 
df_3=pd.merge(df_1,df_2,on='Name')
df_3

    Name  English  Math  Science
0   John       75    85       92
1   Jane       80    90       88
2    Bob       85    78       90
3  Alice       88    92       85
4    Eve       92    88       78

In [113]:
 # add columns
df_3['Total_marks']=df_3['English']+df_3['Math']+df_3['Science']
df_3

    Name  English  Math  Science  Total_marks
0   John       75    85       92          252
1   Jane       80    90       88          258
2    Bob       85    78       90          253
3  Alice       88    92       85          265
4    Eve       92    88       78          258